Catalogs/ЛичныеДанныеКандидатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ЛичныеДанныеКандидатов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициалы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСлужебное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРождения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>240</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеВБраке</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостояниеВБраке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Гражданство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотография</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛичныеДанныеКандидатовПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаКандидатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗнаниеЯзыков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Язык</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЯзыкиНародовМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтепеньЗнанияЯзыкаКандидата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтепениЗнанияЯзыкаКандидата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Образование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОбразования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыОбразованияФизическихЛиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчебноеЗаведение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УчебныеЗаведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факультет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Специальность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторСпециальностейПоОбразованию</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГодОкончания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Курсы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеКурса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчебноеЗаведение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УчебныеЗаведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГодОкончания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительнаяИнформация</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УченыеСтепени</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УченаяСтепень</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УченыеСтепени</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПрисужденияУченойСтепени</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОпытРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Компания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязанности</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СфераДеятельностиКомпании</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ФизическиеЛицаКандидатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ФизическиеЛицаКандидатов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛичныеДанныеКандидата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛичныеДанныеКандидатов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СостоянияВБракеФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СостоянияВБракеФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СостояниеВБраке</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостояниеВБраке</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ГражданствоФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ГражданствоФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ПолФизическогоЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ПолФизическогоЛица</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Мужской</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЛичныеДанныеКандидатов/Ext/ManagerModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Ссылка)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Заполнить данные для электронного тестирования кандидата.
// 
// Параметры:
//  ДанныеДляЗаполнения - Структура: см. ЭлектронноеТестированиеКандидатов.НовыйДанныеДляФормыЭлектронногоТестированияКандидата
//  Учащийся - СправочникСсылка.ЛичныеДанныеКандидатов
Процедура ЗаполнитьДанныеДляЭлектронногоТестированияКандидата(ДанныеДляЗаполнения, Учащийся) Экспорт
	
	ТаблицаКандидатов = Справочники.Кандидаты.КандидатыПоЛичнымДаннымКандидатов(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Учащийся));

	Если ТаблицаКандидатов.Количество() > 0 Тогда
		ДанныеДляЗаполнения.ИмяОтчество = СтрШаблон("%1 %2", ТаблицаКандидатов[0].Имя, ТаблицаКандидатов[0].Отчество);
		ДанныеДляЗаполнения.Кандидат = ТаблицаКандидатов[0].Кандидат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Ищет похожих кандидатов и возвращает результат поиска.
// 
// Параметры:
//  ЛичныеДанныеКандидата - СправочникСсылка.ЛичныеДанныеКандидатов -
// 
// Возвращаемое значение:
//  Структура:
//   * Фамилия - Строка
//   * Имя - Строка
//   * Отчество - Строка
//   * Телефон - Строка
//   * EMail - Строка
//   * ДанныеКандидатов - Массив из Структура:
//      ** ЛичныеДанныеКандидата - СправочникСсылка.ЛичныеДанныеКандидатов 
//      ** Наименование - Строка 
//      ** УточнениеНаименования - Строка 
//      ** ФизическоеЛицо - СправочникСсылка.ФизическиеЛица 
//      ** НомерТелефона - Строка 
//      ** Email - Строка 
//      ** Приоритет - Число 
//   * КандидатУникален - Булево
Функция НайтиПохожих(ЛичныеДанныеКандидата) Экспорт
	
	ПараметрыПоиска = ПодборПерсоналаФормы.ПараметрыПоискаПохожихКандидатов();
	СведенияОЛичныхДанных = ПодборПерсонала.ОсновныеСведенияОЛичныхДанныхКандидатов(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ЛичныеДанныеКандидата));
	ЗаполнитьЗначенияСвойств(ПараметрыПоиска, СведенияОЛичныхДанных[0],
		"Фамилия,Имя,Отчество,УточнениеНаименования,Телефон,EMail");
	ПараметрыПоиска.Ссылка = ЛичныеДанныеКандидата;
	
	ПоискКандидатов = ПодборПерсоналаВызовСервера.ПодобратьПохожихКандидатов(ПараметрыПоиска);
	
	Возврат ПоискКандидатов;
	
КонецФункции

#Область КонструкторыСтруктурХранения

// Возвращает структуру для описания личных данных кандидата
//
// Возвращаемое значение:
//  Структура - Новые данные кандидата:
//   * ФИО - Строка -
//   * Фамилия - Строка -
//   * Имя - Строка -
//   * Отчество - Строка -
//   * УточнениеНаименования - Строка -
//   * ДатаРождения - Дата -
//   * МестоРождения - Строка -
//   * Пол - ПеречислениеСсылка.ПолФизическогоЛица -
//   * СостояниеВБраке - СправочникСсылка.СостояниеВБраке -
//   * Гражданство - СправочникСсылка.СтраныМира -
//   * Фотография - СправочникСсылка.ЛичныеДанныеКандидатовПрисоединенныеФайлы -
//   * ГруппаДоступа - СправочникСсылка.ГруппыДоступаКандидатов -
//   * ЗнаниеЯзыков - Массив из Структура -
//   * Образование - Массив из Структура -
//   * Курсы - Массив из Структура -
//   * УченыеСтепени - Массив из Структура -
//   * ОпытРаботы - Массив из Структура -
Функция НовыеДанныеКандидата() Экспорт
	
	ДанныеКандидата = Новый Структура;
	
	ДанныеКандидата.Вставить("ФИО", "");
	ДанныеКандидата.Вставить("Фамилия", "");
	ДанныеКандидата.Вставить("Имя", "");
	ДанныеКандидата.Вставить("Отчество", "");
	ДанныеКандидата.Вставить("УточнениеНаименования", "");
	ДанныеКандидата.Вставить("ДатаРождения", Дата(1, 1, 1));
	ДанныеКандидата.Вставить("МестоРождения", "");
	ДанныеКандидата.Вставить("Пол", Перечисления.ПолФизическогоЛица.Мужской);
	ДанныеКандидата.Вставить("СостояниеВБраке", Справочники.СостояниеВБраке.ПустаяСсылка());
	ДанныеКандидата.Вставить("Гражданство", Справочники.СтраныМира.Россия);
	ДанныеКандидата.Вставить("Фотография", Справочники.ЛичныеДанныеКандидатовПрисоединенныеФайлы.ПустаяСсылка());
	ДанныеКандидата.Вставить("ГруппаДоступа", Справочники.ГруппыДоступаКандидатов.ПустаяСсылка());
	
	ДанныеКандидата.Вставить("ЗнаниеЯзыков", Новый Массив);
	ДанныеКандидата.Вставить("Образование", Новый Массив);
	ДанныеКандидата.Вставить("Курсы", Новый Массив);
	ДанныеКандидата.Вставить("УченыеСтепени", Новый Массив);
	ДанныеКандидата.Вставить("ОпытРаботы", Новый Массив);
	
	Возврат ДанныеКандидата;
	
КонецФункции

// Возвращает структуру для описания данных об образовании физического лица.
// 
// Возвращаемое значение:
//  Структура:
//   * УчебноеЗаведение - СправочникСсылка.УчебныеЗаведения
//   * Факультет - Строка -
//   * Квалификация - Строка -
//   * Специальность - СправочникСсылка.КлассификаторСпециальностейПоОбразованию
//   * НаименованиеКурса - Строка -
//   * Окончание - Число
//   * ВидОбразования - СправочникСсылка.ВидыОбразованияФизическихЛиц
//   * ВидПослевузовскогоОбразования - СправочникСсылка.ВидыОбразованияФизическихЛиц
//   * ВидДополнительногоОбучения - ПеречислениеСсылка.ВидыПрофессиональнойПодготовки
Функция НовоеОбразованиеДляФизическогоЛица() Экспорт
	
	Образование = Новый Структура;
	
	Образование.Вставить("УчебноеЗаведение", Справочники.УчебныеЗаведения.ПустаяСсылка());
	Образование.Вставить("Факультет", "");
	Образование.Вставить("Квалификация", "");
	Образование.Вставить("Специальность", Справочники.КлассификаторСпециальностейПоОбразованию.ПустаяСсылка());
	Образование.Вставить("НаименованиеКурса", "");
	Образование.Вставить("Окончание", Год(ТекущаяДатаСеанса()));
	Образование.Вставить("ВидОбразования", Справочники.ВидыОбразованияФизическихЛиц.ПустаяСсылка());
	Образование.Вставить("ВидПослевузовскогоОбразования", Справочники.ВидыОбразованияФизическихЛиц.ПустаяСсылка());
	Образование.Вставить("ВидДополнительногоОбучения", Перечисления.ВидыПрофессиональнойПодготовки.ПустаяСсылка());
	
	Возврат Образование;
	
КонецФункции

// Возвращает структуру для описания данных об образовании.
// 
// Возвращаемое значение:
//  Структура:
//   * ВидОбразования - СправочникСсылка.ВидыОбразованияФизическихЛиц
//   * УчебноеЗаведение - СправочникСсылка.УчебныеЗаведения
//   * Факультет - Строка -
//   * Специальность - СправочникСсылка.КлассификаторСпециальностейПоОбразованию
//   * ГодОкончания - Число
Функция НовоеОбразование() Экспорт
	
	Образование = Новый Структура;
	
	Образование.Вставить("ВидОбразования", Справочники.ВидыОбразованияФизическихЛиц.ПустаяСсылка());
	Образование.Вставить("УчебноеЗаведение", Справочники.УчебныеЗаведения.ПустаяСсылка());
	Образование.Вставить("Факультет", "");
	Образование.Вставить("Специальность", Справочники.КлассификаторСпециальностейПоОбразованию.ПустаяСсылка());
	Образование.Вставить("ГодОкончания", Год(ТекущаяДатаСеанса()));
	
	Возврат Образование;
	
КонецФункции

// Возвращает структуру для описания данных о пройденных курсах.
// 
// Возвращаемое значение:
//  Структура:
//   * НаименованиеКурса - Строка
//   * УчебноеЗаведение - СправочникСсылка.УчебныеЗаведения
//   * ГодОкончания - Число
//   * ДополнительнаяИнформация - Строка
Функция НовыйКурсы() Экспорт
	
	Образование = Новый Структура;
	
	Образование.Вставить("НаименованиеКурса", "");
	Образование.Вставить("УчебноеЗаведение", Справочники.УчебныеЗаведения.ПустаяСсылка());
	Образование.Вставить("ГодОкончания", Год(ТекущаяДатаСеанса()));
	Образование.Вставить("ДополнительнаяИнформация", "");
	
	Возврат Образование;
	
КонецФункции

// Возвращает структуру для описания данных об опыте работы.
// 
// Возвращаемое значение:
//  Структура:
//   * Компания - Строка -
//   * Период - Дата -
//   * ДатаНачала - Дата -
//   * ДатаОкончания - Дата -
//   * Должность - Строка -
//   * Обязанности - Строка -
//   * СфераДеятельностиКомпании - Строка -
Функция НовыйОпытРаботы() Экспорт
	
	ОпытРаботы = Новый Структура;
	ОпытРаботы.Вставить("Компания", "");
	ОпытРаботы.Вставить("Период", Дата(1, 1, 1));
	ОпытРаботы.Вставить("ДатаНачала", Дата(1, 1, 1));
	ОпытРаботы.Вставить("ДатаОкончания", Дата(1, 1, 1));
	ОпытРаботы.Вставить("Должность", "");
	ОпытРаботы.Вставить("Обязанности", "");
	ОпытРаботы.Вставить("СфераДеятельностиКомпании", "");
	
	Возврат ОпытРаботы;
	
КонецФункции

// Возвращает структуру для описания знания языка кандидата.
// 
// Возвращаемое значение:
//  Структура:
//   * Язык - СправочникСсылка.ЯзыкиНародовМира -
//   * СтепеньЗнанияЯзыкаКандидата - СправочникСсылка.СтепениЗнанияЯзыкаКандидата -
Функция НовоеЗнаниеЯзыка() Экспорт
	
	ЗнаниеЯзыка = Новый Структура;
	ЗнаниеЯзыка.Вставить("Язык", Справочники.ЯзыкиНародовМира.ПустаяСсылка());
	ЗнаниеЯзыка.Вставить("СтепеньЗнанияЯзыкаКандидата", Справочники.СтепениЗнанияЯзыкаКандидата.ПустаяСсылка());
	
	Возврат ЗнаниеЯзыка;
	
КонецФункции

// Возвращает структуру для описания ученой степени кандидата.
// 
// Возвращаемое значение:
//  Структура:
//   * УченаяСтепень - СправочникСсылка.УченыеСтепени
//   * ДатаПрисужденияУченойСтепени - Дата
Функция НоваяУченаяСтепень() Экспорт
	
	УченаяСтепень = Новый Структура;
	УченаяСтепень.Вставить("УченаяСтепень", Справочники.УченыеСтепени.ПустаяСсылка());
	УченаяСтепень.Вставить("ДатаПрисужденияУченойСтепени", Дата(1, 1, 1));
	
	Возврат УченаяСтепень;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоРазделамДанных(Настройки, "ПодборПерсонала");
КонецПроцедуры

#КонецОбласти

// Создает новое физическое лицо на основании личных данных кандидата.
// 
// Параметры:
//  ЛичныеДанныеКандидата - СправочникСсылка.ЛичныеДанныеКандидатов
//  ДополнительныеПараметры - Структура:
//    * ГруппаДоступа - СправочникСсылка.ГруппыДоступаФизическихЛиц
// 
// Возвращаемое значение:
//  СправочникСсылка.ФизическиеЛица
Функция СоздатьФизическоеЛицоПоДаннымКандидата(ЛичныеДанныеКандидата, ДополнительныеПараметры = Неопределено) Экспорт
	
	НачатьТранзакцию();
	Попытка
		УстановитьПривилегированныйРежим(Истина);
		ФизическоеЛицоОбъект = ОбъектФизическоеЛицоПоДаннымКандидата(ЛичныеДанныеКандидата, ДополнительныеПараметры);
		ФизическоеЛицоОбъект.Записать();
		РегистрыСведений.ФизическиеЛицаКандидатов.УстановитьСвязьКандидатаСФизическимЛицом(ЛичныеДанныеКандидата,
			ФизическоеЛицоОбъект.Ссылка);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

	Возврат ФизическоеЛицоОбъект.Ссылка;
	
КонецФункции

// Создает объект физическое лицо на основании личных данных кандидата.
// 
// Параметры:
//  ЛичныеДанныеКандидатаСсылка - СправочникСсылка.ЛичныеДанныеКандидатов
//  ДополнительныеПараметры - Структура:
//    * ГруппаДоступа - СправочникСсылка.ГруппыДоступаФизическихЛиц
// 
// Возвращаемое значение:
//  СправочникОбъект.ФизическиеЛица
Функция ОбъектФизическоеЛицоПоДаннымКандидата(ЛичныеДанныеКандидатаСсылка, ДополнительныеПараметры = Неопределено) Экспорт
	
	Попытка
		ЛичныеДанныеКандидата = ЛичныеДанныеКандидатаСсылка.ПолучитьОбъект();
		
		ФИО = Новый Структура;
		ФИО.Вставить("Фамилия", ЛичныеДанныеКандидата.Фамилия);
		ФИО.Вставить("Имя", ЛичныеДанныеКандидата.Имя);
		ФИО.Вставить("Отчество", ЛичныеДанныеКандидата.Отчество);
		
		ДанныеФизическогоЛица = КадровыйУчет.НовыеДанныеФизическогоЛица();
		ЗаполнитьДанныеФизическогоЛица(ДанныеФизическогоЛица, ЛичныеДанныеКандидата, ДополнительныеПараметры);
		
		ФизическоеЛицоОбъект = КадровыйУчет.НовоеФизическоеЛицо(ФИО, ДанныеФизическогоЛица, , Ложь);
	Исключение
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат ФизическоеЛицоОбъект;
	
КонецФункции

// АПК:581-выкл.

// Создает личные данные кандидата по физическому лицу.
// 
// Параметры:
//  ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
//  ЭтоОбработчикОбновления - Булево - Истина, если вызвана из обработчика обновления
// 
// Возвращаемое значение:
//  СправочникСсылка.ЛичныеДанныеКандидатов
Функция СоздатьПоФизическомуЛицу(ФизическоеЛицо, ЭтоОбработчикОбновления = Ложь) Экспорт
	
	НачатьТранзакцию();
	Попытка
		ЛичныеДанныеКандидатаОбъект = СоздатьЭлемент();
		ЛичныеДанныеКандидатаОбъект.Заполнить(ФизическоеЛицо);
		ЛичныеДанныеКандидатаОбъект.ГруппаДоступа = НайтиСоздатьГруппуДоступаКандидатовПоФизЛицу(ФизическоеЛицо);
		
		Если ЭтоОбработчикОбновления Тогда
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЛичныеДанныеКандидатаОбъект, Истина, Истина);
		Иначе
			ЛичныеДанныеКандидатаОбъект.Записать();
		КонецЕсли;
		
		ЛичныеДанныеКандидата = ЛичныеДанныеКандидатаОбъект.Ссылка;
		
		Фотография = КопияФотографииФизическогоЛица(ЛичныеДанныеКандидата, ФизическоеЛицо);
		Если ЗначениеЗаполнено(Фотография) Тогда
			ЛичныеДанныеКандидатаОбъект.Фотография = Фотография;
			Если ЭтоОбработчикОбновления Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЛичныеДанныеКандидатаОбъект, Истина);
			Иначе
				ЛичныеДанныеКандидатаОбъект.Записать();
			КонецЕсли;
		КонецЕсли;
		
		РегистрыСведений.ФизическиеЛицаКандидатов.УстановитьСвязьКандидатаСФизическимЛицом(ЛичныеДанныеКандидата,
			ФизическоеЛицо);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат ЛичныеДанныеКандидата;
	
КонецФункции

// АПК:581-вкл.

// Параметры:
//  ДанныеФизическогоЛица - см. КадровыйУчет.НовыеДанныеФизическогоЛица
//  ЛичныеДанныеКандидата - СправочникОбъект.ЛичныеДанныеКандидатов
//  ДополнительныеПараметры - Структура:
//    * ГруппаДоступа - СправочникСсылка.ГруппыДоступаФизическихЛиц
//    * ИдентификаторФормы - УникальныйИдентификатор
//    * АдресФотографии - УникальныйИдентификатор
Процедура ЗаполнитьДанныеФизическогоЛица(ДанныеФизическогоЛица, ЛичныеДанныеКандидата,
	ДополнительныеПараметры = Неопределено) Экспорт
	
	ДатаОтсчета = ЗарплатаКадрыКлиентСервер.ДатаОтсчетаПериодическихСведений();
	ЛичныеДанныеКандидатаСсылка = ЛичныеДанныеКандидата.Ссылка;
	
	ДанныеФизическогоЛица.ДатаРождения = ЛичныеДанныеКандидата.ДатаРождения;
	ДанныеФизическогоЛица.Пол = ЛичныеДанныеКандидата.Пол;
	ДанныеФизическогоЛица.МестоРождения = ЛичныеДанныеКандидата.МестоРождения;
	ДанныеФизическогоЛица.Образование = ДанныеОбОбразованииДляФизЛица(ЛичныеДанныеКандидатаСсылка);
	ДанныеФизическогоЛица.ТрудоваяДеятельность = ДанныеОТрудовойДеятельностиДляФизЛица(
		ЛичныеДанныеКандидатаСсылка);
	ДанныеФизическогоЛица.ЗнаниеЯзыков = ДанныеОЗнанииЯзыковДляФизЛица(ЛичныеДанныеКандидатаСсылка);
	ДанныеФизическогоЛица.УченыеСтепени = ДанныеОбУченыхСтепеняхДляФизЛица(ЛичныеДанныеКандидатаСсылка);
	
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ГруппаДоступа") <> Неопределено Тогда
		ДанныеФизическогоЛица.ГруппаДоступа = ДополнительныеПараметры.ГруппаДоступа;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЛичныеДанныеКандидата.СостояниеВБраке) Тогда
		ДанныеОСостоянииВБраке = РегистрыСведений.СостоянияВБракеФизическихЛиц.НовоеСостояниеВБраке();
		ДанныеОСостоянииВБраке.СостояниеВБраке = ЛичныеДанныеКандидата.СостояниеВБраке;
		ДанныеОСостоянииВБраке.Период = ДатаОтсчета;
		ДанныеФизическогоЛица.СостояниеВБраке = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
			ДанныеОСостоянииВБраке);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЛичныеДанныеКандидата.Гражданство) Тогда
		ДанныеОГражданстве = РегистрыСведений.ГражданствоФизическихЛиц.НовоеГражданство();
		ДанныеОГражданстве.Гражданство = ЛичныеДанныеКандидата.Гражданство;
		ДанныеОГражданстве.Период = ДатаОтсчета;
		ДанныеФизическогоЛица.Гражданство = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеОГражданстве);
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "АдресФотографии") <> Неопределено Тогда
		ДанныеФизическогоЛица.АдресФотографии = ДополнительныеПараметры.АдресФотографии;
	ИначеЕсли ЗначениеЗаполнено(ЛичныеДанныеКандидата.Фотография) Тогда
		ДвоичныеДанные = РаботаСФайлами.ДвоичныеДанныеФайла(ЛичныеДанныеКандидата.Фотография);
		Фото = Новый Картинка(ДвоичныеДанные);
		Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры,
			"ИдентификаторФормы") <> Неопределено Тогда
			Идентификатор = ДополнительныеПараметры.ИдентификаторФормы;
		Иначе
			Идентификатор = Новый УникальныйИдентификатор();
		КонецЕсли;
		АдресФотографии = ПоместитьВоВременноеХранилище(Фото, Идентификатор);
		ДанныеФизическогоЛица.АдресФотографии = АдресФотографии;
	КонецЕсли;
	
	КонтактнаяИнформация = Новый Массив();
	
	КонтактнаяИнформацияКандидата = ЛичныеДанныеКандидата.КонтактнаяИнформация.Выгрузить();
	Для Каждого ТекущаяСтрока Из КонтактнаяИнформацияКандидата Цикл
		Если ТекущаяСтрока.Вид = Справочники.ВидыКонтактнойИнформации.АдресЛичныеДанныеКандидатов Тогда
			ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица;
		ИначеЕсли ТекущаяСтрока.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонЛичныеДанныеКандидатов Тогда
			ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица;
		ИначеЕсли ТекущаяСтрока.Вид = Справочники.ВидыКонтактнойИнформации.EMailЛичныеДанныеКандидатов Тогда
			ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица;
		Иначе
			Продолжить;
		КонецЕсли;

		ДанныеКИ = КадровыйУчет.НоваяКонтактнаяИнформация();
		ДанныеКИ.ВидИнформации = ВидКонтактнойИнформации;
		ДанныеКИ.ТипИнформации = ТекущаяСтрока.Тип;
		ДанныеКИ.ЗначенияПолей = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(
			ТекущаяСтрока.Представление, ВидКонтактнойИнформации);
		КонтактнаяИнформация.Добавить(ДанныеКИ);
	КонецЦикла;
	
	Если КонтактнаяИнформация.Количество() > 0 Тогда
		ДанныеФизическогоЛица.КонтактнаяИнформация = КонтактнаяИнформация;
	КонецЕсли;
		
КонецПроцедуры

// Возвращает наименование кандидата.
// 
// Параметры:
//  ФИО - Структура:
//    * Фамилия - Строка
//    * Имя - Строка
//    * Отчество - Строка
//  УточнениеНаименованияФизЛица - Строка
//  УточнениеНаименованияКандидата - Строка
// 
// Возвращаемое значение:
//  Строка
Функция НаименованиеКандидата(ФИО, УточнениеНаименованияФизЛица = "", УточнениеНаименованияКандидата = "") Экспорт
	
	Возврат КадровыйУчетКлиентСервер.ПолноеНаименованиеСотрудника(
		ФИО.Фамилия, 
		ФИО.Имя, 
		ФИО.Отчество, 
		УточнениеНаименованияФизЛица, 
		УточнениеНаименованияКандидата);
	
КонецФункции

// Получает физические лица кандидатов.
// 
// Параметры:
// 	ЛичныеДанныеКандидатов - Массив Из СправочникСсылка.ЛичныеДанныеКандидатов - массив кандидатов
// 	ТолькоНеПомеченныеНаУдаление - Булево
// Возвращаемое значение:
// 	Соответствие из КлючИЗначение:
//    * Ключ - СправочникСсылка.ЛичныеДанныеКандидатов - кандидат из исходного массива
//    * Значение - СправочникСсылка.ФизическиеЛица - физическое лицо кандидата
Функция ФизическиеЛицаЛичныхДанныхКандидатов(ЛичныеДанныеКандидатов, ТолькоНеПомеченныеНаУдаление = Ложь) Экспорт
	
	Выборка = ВыборкаФизическиеЛицаКандидатов(ЛичныеДанныеКандидатов);
	
	Результат = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		Если ТолькоНеПомеченныеНаУдаление И Выборка.ФизическоеЛицоПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		Результат.Вставить(Выборка.ЛичныеДанныеКандидата, Выборка.ФизическоеЛицо);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Получает физическое лицо кандидата.
// 
// Параметры:
// 	ЛичныеДанныеКандидата - СправочникСсылка.ЛичныеДанныеКандидатов 
// Возвращаемое значение:
// 	СправочникСсылка.ФизическиеЛица
Функция ФизическоеЛицоЛичныхДанныхКандидата(ЛичныеДанныеКандидата) Экспорт
	
	ФизическоеЛицо = ФизическиеЛицаЛичныхДанныхКандидатов(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ЛичныеДанныеКандидата))[ЛичныеДанныеКандидата];
	
	Если ФизическоеЛицо = Неопределено Тогда
		ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка();
	КонецЕсли;
	
	Возврат ФизическоеЛицо;
	
КонецФункции

// Получает личные данные кандидатов для физических лиц.
// 
// Параметры:
//  ФизическиеЛица - Массив Из СправочникСсылка.ФизическиеЛица - физические лица
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//    * Ключ - СправочникСсылка.ФизическиеЛица - физическое лицо
//    * Значение - СправочникСсылка.ЛичныеДанныеКандидатов - личные данные кандидата
Функция ЛичныеДанныеКандидатовФизическихЛиц(ФизическиеЛица) Экспорт
	
	//@skip-check invocation-parameter-type-intersect
	Выборка = ВыборкаФизическиеЛицаКандидатов(, ФизическиеЛица);
	
	Результат = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.ФизическоеЛицо, Выборка.ЛичныеДанныеКандидата);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Личные данные кандидата физического лица.
// 
// Параметры:
//  ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
// 
// Возвращаемое значение:
//  СправочникСсылка.ЛичныеДанныеКандидатов,Неопределено
Функция ЛичныеДанныеКандидатаФизическогоЛица(ФизическоеЛицо) Экспорт
	
	Если ТипЗнч(ФизическоеЛицо) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Возврат ЛичныеДанныеКандидатовФизическихЛиц(
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ФизическоеЛицо))[ФизическоеЛицо];
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Сохраняет фотографию кандидата и возвращает ссылку на нее.
// 
// Параметры:
//  ЛичныеДанныеКандидата - СправочникСсылка.ЛичныеДанныеКандидатов - владелец фотографии
//  АдресФотографии - Строка,Неопределено - адрес временного хранилища фотографии, в котором хранятся двоичные данные
// 
// Возвращаемое значение:
//  СправочникСсылка.ЛичныеДанныеКандидатовПрисоединенныеФайлы,Неопределено -Сохраненная фотография
Функция СохраненнаяФотография(ЛичныеДанныеКандидата, АдресФотографии) Экспорт
	
	Если Не ЗначениеЗаполнено(АдресФотографии) Тогда
		Возврат Справочники.ЛичныеДанныеКандидатовПрисоединенныеФайлы.ПустаяСсылка();
	КонецЕсли;
	
	ПараметрыФайла = РаботаСФайлами.ПараметрыДобавленияФайла();
	ПараметрыФайла.ВладелецФайлов = ЛичныеДанныеКандидата;
	ПараметрыФайла.ИмяБезРасширения = "Фотография";
	ПараметрыФайла.Служебный = Истина;
	
	Возврат РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, АдресФотографии);
	
КонецФункции

#Область ОбработчикиОбновления

// Заполняет личные данные кандидатов при обновлении.
// 
// Параметры:
//  ПараметрыОбновления - Структура
Процедура ЗаполнитьЛичныеДанныеКандидатов(ПараметрыОбновления) Экспорт

	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
		"ОбработкаЗавершена", Ложь);
		
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить(Метаданные.Справочники.Кандидаты.ПолноеИмя());
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки = Блокировка.Добавить(Метаданные.Справочники.ГруппыДоступаКандидатов.ПолноеИмя());
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		
		ТаблицаКандидатов = КандидатыДляОбработки();
		
		Если ТаблицаКандидатов.Количество() = 0 Тогда
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
				"ОбработкаЗавершена", Истина);
			ЗафиксироватьТранзакцию();
			Возврат;
		КонецЕсли;
		
		ФизическиеЛица = ТаблицаКандидатов.ВыгрузитьКолонку("ФизическоеЛицо");
		ПараметрыСотрудников = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
		//@skip-check property-return-type
		ПараметрыСотрудников.СписокФизическихЛиц = ФизическиеЛица;
		ПараметрыСотрудников.РаботникиПоТрудовымДоговорам = Истина;
		ПараметрыСотрудников.РаботникиПоДоговорамГПХ = Истина;
		ПараметрыСотрудников.ВыбрасыватьИсключениеДоступа = Ложь;
		Сотрудники = КадровыйУчет.СотрудникиОрганизации(Истина, ПараметрыСотрудников);
		ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(Сотрудники, "ФизическоеЛицо");
		
		ФизическиеЛицаИДанныеКандидатов = НовоеСоответствиеФизическихЛицИКандидатов();
			
		Для Каждого СтрокаТаблицы Из ТаблицаКандидатов Цикл
			КандидатОбъект = СтрокаТаблицы.Кандидат.ПолучитьОбъект();
			Если ЗначениеЗаполнено(СтрокаТаблицы.ЛичныеДанныеКандидатаСвязанныеСФизлицом) Тогда
				ЛичныеДанныеКандидата = СтрокаТаблицы.ЛичныеДанныеКандидатаСвязанныеСФизлицом;
			ИначеЕсли ЗначениеЗаполнено(СтрокаТаблицы.ФизическоеЛицо) Тогда
				ЛичныеДанныеКандидата = ФизическиеЛицаИДанныеКандидатов.Получить(СтрокаТаблицы.ФизическоеЛицо);
				Если ЛичныеДанныеКандидата = Неопределено Тогда
					ЛичныеДанныеКандидата = СоздатьПоФизическомуЛицу(СтрокаТаблицы.ФизическоеЛицо, Истина);
					НайденныеСтроки = Сотрудники.НайтиСтроки(Новый Структура("ФизическоеЛицо",
						СтрокаТаблицы.ФизическоеЛицо));
					Если НайденныеСтроки.Количество() = 0 Тогда
						ФизическоеЛицоОбъект = СтрокаТаблицы.ФизическоеЛицо.ПолучитьОбъект();
						ФизическоеЛицоОбъект.УстановитьПометкуУдаления(Истина);
					КонецЕсли;
					ФизическиеЛицаИДанныеКандидатов.Вставить(СтрокаТаблицы.ФизическоеЛицо, ЛичныеДанныеКандидата);
				КонецЕсли;
			Иначе
				ОбщегоНазначенияКлиентСервер.Проверить(Ложь,
					СтрШаблон(НСтр("ru = 'У кандидата %1 не заполнено физическое лицо'"), СтрокаТаблицы.Кандидат),
					"ЗаполнитьЛичныеДанныеКандидатов");
			КонецЕсли;
			КандидатОбъект.ЛичныеДанные = ЛичныеДанныеКандидата;
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(КандидатОбъект, Истина);
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

// Заполнение данных поиска кандидатов при обновлении.
// 
// Параметры:
//  ПараметрыОбновления - Структура:
//    * Обработанные - Массив из СправочникСсылка.ЛичныеДанныеКандидатов
//    * ОбработкаЗавершена - Булево
Процедура ЗаполнитьДанныеПоискаКандидатов(ПараметрыОбновления = Неопределено) Экспорт

	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
		"ОбработкаЗавершена", Ложь);
	Обработанные = Новый Массив;
		
	Пока Не ПараметрыОбновления.ОбработкаЗавершена Цикл
	
		Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ПоискФизическихЛиц") Тогда
			МодульПоискФизическихЛиц = ОбщегоНазначения.ОбщийМодуль("ПоискФизическихЛиц");
		Иначе
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
				"ОбработкаЗавершена", Истина);
			Продолжить;
		КонецЕсли;
		
		//@skip-check query-in-loop
		Выборка = ДанныеПоискаКандидатовДляОбработки(Обработанные);
		Если Выборка.Количество() = 0 Тогда
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
				"ОбработкаЗавершена", Истина);
			Продолжить;
		КонецЕсли;
		
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
			"ОбработкаЗавершена", Ложь);
		
		ЛичныеДанныеКандидатов = Новый Массив;
		Пока Выборка.Следующий() Цикл
			ЛичныеДанныеКандидатов.Добавить(Выборка.ЛичныеДанныеКандидата);
		КонецЦикла;
		МодульПоискФизическихЛиц.ЗаполнитьДанныеПоиска(ЛичныеДанныеКандидатов, ПараметрыОбновления);
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Обработанные, ЛичныеДанныеКандидатов);

	КонецЦикла;
	
КонецПроцедуры

// Возвращает таблицу значений с историей взаимоотношений с кандидатом
// 
// Параметры:
//  ЛичныеДанныеКандидата - СправочникСсылка.ЛичныеДанныеКандидатов
// 
// Возвращаемое значение:
//  Массив из Структура:
//   * ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
//   * Кандидат - СправочникСсылка.Кандидаты
//   * Ссылка - СправочникСсылка
//   * Примечание - Строка -
//   * Роль - Число -
//   * ГруппаРоли - Число -
//   * ДатаАктуальности - Дата -
Функция ИсторияВзаимоотношений(ЛичныеДанныеКандидата) Экспорт
	
	ОбъектыВзаимоотношений = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ЛичныеДанныеКандидата);
	ФизическоеЛицо = ПодборПерсонала.ФизическоеЛицоЛичныхДанныхКандидата(ЛичныеДанныеКандидата);
	Если ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		//@skip-check invocation-parameter-type-intersect
		ОбъектыВзаимоотношений.Добавить(ФизическоеЛицо);
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(СотрудникиФормы.ИсторияВзаимоотношенийСКомпанией(
		ОбъектыВзаимоотношений));
	
КонецФункции

Функция КопияФотографииФизическогоЛица(ЛичныеДанныеКандидата, ФизическоеЛицо) Экспорт
	
	АдресФотографии = КадровыйУчетРасширенный.АдресФотографииФизическогоЛица(ФизическоеЛицо);
	Если Не ЭтоАдресВременногоХранилища(АдресФотографии) Тогда
		Возврат Справочники.ЛичныеДанныеКандидатовПрисоединенныеФайлы.ПустаяСсылка();
	КонецЕсли;
	
	ФотографияФизЛица = ПолучитьИзВременногоХранилища(АдресФотографии);
	Если Не ЗначениеЗаполнено(ФотографияФизЛица) Тогда
		Возврат Справочники.ЛичныеДанныеКандидатовПрисоединенныеФайлы.ПустаяСсылка();
	ИначеЕсли ТипЗнч(ФотографияФизЛица) = Тип("Картинка") Тогда
		ДвоичныеДанные = ФотографияФизЛица.ПолучитьДвоичныеДанные();
		АдресФотографии = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	КонецЕсли;
	
	Возврат СохраненнаяФотография(ЛичныеДанныеКандидата, АдресФотографии);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
// 
// Возвращаемое значение:
//  СправочникСсылка.ГруппыДоступаКандидатов
Функция НайтиСоздатьГруппуДоступаКандидатовПоФизЛицу(ФизическоеЛицо)
	
	ГруппаДоступаФизЛица = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ФизическоеЛицо, "ГруппаДоступа");
	
	Если Не ЗначениеЗаполнено(ГруппаДоступаФизЛица) Тогда
		Возврат Справочники.ГруппыДоступаКандидатов.ПустаяСсылка();
	КонецЕсли;
	
	НаименованиеГруппы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ГруппаДоступаФизЛица, "Наименование");
	ГруппаДоступа = Справочники.ГруппыДоступаКандидатов.НайтиПоНаименованию(НаименованиеГруппы);
	Если Не ЗначениеЗаполнено(ГруппаДоступа) Тогда
		ГруппаДоступаОбъект = Справочники.ГруппыДоступаКандидатов.СоздатьЭлемент();
		ГруппаДоступаОбъект.Наименование = НаименованиеГруппы;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ГруппаДоступаОбъект, Истина);
		ГруппаДоступа = ГруппаДоступаОбъект.Ссылка;
	КонецЕсли;
	
	Возврат ГруппаДоступа;
	
КонецФункции

// Возвращает таблицу кандидатов для обработки.
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//    * Кандидат - СправочникСсылка.Кандидаты
//    * ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
//    * ЛичныеДанныеКандидата - СправочникСсылка.ЛичныеДанныеКандидатов
//    * ЛичныеДанныеКандидатаСвязанныеСФизлицом - СправочникСсылка.ЛичныеДанныеКандидатов
Функция КандидатыДляОбработки()
	
	Если Метаданные.Справочники.Кандидаты.Реквизиты.Найти("УдалитьФизическоеЛицо") = Неопределено Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	Кандидаты.Ссылка КАК Кандидат,
		|	Кандидаты.УдалитьФизическоеЛицо КАК ФизическоеЛицо,
		|	ФизическиеЛицаКандидатов.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидатаСвязанныеСФизлицом
		|ИЗ
		|	Справочник.Кандидаты КАК Кандидаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФизическиеЛицаКандидатов КАК ФизическиеЛицаКандидатов
		|		ПО Кандидаты.УдалитьФизическоеЛицо = ФизическиеЛицаКандидатов.ФизическоеЛицо
		|		И ФизическиеЛицаКандидатов.ФизическоеЛицо <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|ГДЕ
		|	Кандидаты.ЛичныеДанные = ЗНАЧЕНИЕ(Справочник.ЛичныеДанныеКандидатов.ПустаяСсылка)";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;

КонецФункции

// Данные поиска кандидатов для обработки.
// 
// Параметры:
//  Обработанные - Массив из СправочникСсылка.ЛичныеДанныеКандидатов
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса
//    * ЛичныеДанныеКандидата - СправочникСсылка.ЛичныеДанныеКандидатов
Функция ДанныеПоискаКандидатовДляОбработки(Обработанные)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ЛичныеДанныеКандидатов.Ссылка КАК ЛичныеДанныеКандидата
		|ИЗ
		|	Справочник.ЛичныеДанныеКандидатов КАК ЛичныеДанныеКандидатов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПоискаФизическихЛиц КАК ДанныеПоискаФизическихЛиц
		|		ПО ЛичныеДанныеКандидатов.Ссылка = ДанныеПоискаФизическихЛиц.ФизическоеЛицо
		|ГДЕ
		|	ДанныеПоискаФизическихЛиц.ФизическоеЛицо ЕСТЬ NULL
		|	И НЕ ЛичныеДанныеКандидатов.Ссылка В (&Обработанные)";
	
	Запрос.УстановитьПараметр("Обработанные", Обработанные);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка;
	
КонецФункции

// Возвращает выборку личных данных кандидатов.
// 
// Параметры:
//  ЛичныеДанныеКандидатов - Массив из СправочникСсылка.ЛичныеДанныеКандидатов
//  ФизическиеЛица - Массив из СправочникСсылка.ФизическиеЛица
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса:
//    * ЛичныеДанныеКандидата - СправочникСсылка.ЛичныеДанныеКандидатов
//    * ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
//    * ФизическоеЛицоПометкаУдаления - Булево
Функция ВыборкаФизическиеЛицаКандидатов(ЛичныеДанныеКандидатов = Неопределено, ФизическиеЛица = Неопределено)
	
	Запрос = Новый Запрос;
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ФизическиеЛицаКандидатов.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	ФизическиеЛицаКандидатов.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ФизическиеЛицаКандидатов.ФизическоеЛицо.ПометкаУдаления КАК ФизическоеЛицоПометкаУдаления
		|ИЗ
		|	РегистрСведений.ФизическиеЛицаКандидатов КАК ФизическиеЛицаКандидатов
		|ГДЕ
		|	&ЛичныеДанныеКандидатов
		|	И &ФизическиеЛица";
	
	Если ЛичныеДанныеКандидатов = Неопределено Тогда
		Запрос.УстановитьПараметр("ЛичныеДанныеКандидатов", Истина);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЛичныеДанныеКандидатов",
			"ФизическиеЛицаКандидатов.ЛичныеДанныеКандидата В (&ЛичныеДанныеКандидатов)");
		Запрос.УстановитьПараметр("ЛичныеДанныеКандидатов", ЛичныеДанныеКандидатов);
	КонецЕсли;
	
	Если ФизическиеЛица = Неопределено Тогда
		Запрос.УстановитьПараметр("ФизическиеЛица", Истина);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ФизическиеЛица",
			"ФизическиеЛицаКандидатов.ФизическоеЛицо В (&ФизическиеЛица)");
		Запрос.УстановитьПараметр("ФизическиеЛица", ФизическиеЛица);
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Возврат Выборка;
	
КонецФункции

// Возвращаемое значение:
//  Соответствие  из КлючИЗначение:
//   * Ключ - СправочникСсылка.ФизическиеЛица
//   * Значение - СправочникСсылка.ЛичныеДанныеКандидатов
Функция НовоеСоответствиеФизическихЛицИКандидатов()
	
	Возврат Новый Соответствие();
	
КонецФункции

#Область ЗаполнениеДанныхФизЛица

// Параметры:
//  ЛичныеДанныеКандидата - СправочникСсылка.ЛичныеДанныеКандидатов
// 
// Возвращаемое значение:
//  ТаблицаЗначений - см. Справочники.ОбразованиеФизическихЛиц.НовыеДанныеОбОбразовании
Функция ДанныеОбОбразованииДляФизЛица(ЛичныеДанныеКандидата)
	
	ОбразованиеКандидата = ПодборПерсонала.ОбразованиеКандидатов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		ЛичныеДанныеКандидата));
	КурсыКандидата = ПодборПерсонала.КурсыКандидатов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		ЛичныеДанныеКандидата));
	
	Если ОбразованиеКандидата.Количество() = 0 И КурсыКандидата.Количество() = 0 Тогда
		Возврат Справочники.ОбразованиеФизическихЛиц.НовыеДанныеОбОбразовании();
	КонецЕсли;
	
	Образование = Новый Массив;
	
	Для Каждого ТекущаяСтрока Из ОбразованиеКандидата Цикл
		СведенияОбОбразовании = НовоеОбразованиеДляФизическогоЛица();
		ЗаполнитьЗначенияСвойств(СведенияОбОбразовании, ТекущаяСтрока);
		СведенияОбОбразовании.Окончание = ТекущаяСтрока.ГодОкончания;
		Образование.Добавить(СведенияОбОбразовании);
	КонецЦикла;

	Для Каждого ТекущаяСтрока Из КурсыКандидата Цикл
		СведенияОбОбразовании = НовоеОбразованиеДляФизическогоЛица();
		ЗаполнитьЗначенияСвойств(СведенияОбОбразовании, ТекущаяСтрока);
		СведенияОбОбразовании.Окончание = ТекущаяСтрока.ГодОкончания;
		Образование.Добавить(СведенияОбОбразовании);
	КонецЦикла;
	
	Возврат Справочники.Кандидаты.ПодготовитьДанныеОбОбразовании(Образование);
	
КонецФункции

// Параметры:
//  ЛичныеДанныеКандидата - СправочникСсылка.ЛичныеДанныеКандидатов
// 
// Возвращаемое значение:
//  Массив из Структура - см. РегистрыСведений.ТрудоваяДеятельностьФизическихЛиц.НоваяТрудоваяДеятельность
Функция ДанныеОТрудовойДеятельностиДляФизЛица(ЛичныеДанныеКандидата)
	
	ДанныеОТрудовойДеятельности = Новый Массив;
	
	ОпытРаботы = ПодборПерсонала.ОпытРаботыКандидатов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		ЛичныеДанныеКандидата));
		
	Для Каждого СтрокаОпытРаботы Из ОпытРаботы Цикл
		ТрудоваяДеятельность = РегистрыСведений.ТрудоваяДеятельностьФизическихЛиц.НоваяТрудоваяДеятельность();
		ЗаполнитьЗначенияСвойств(ТрудоваяДеятельность, СтрокаОпытРаботы);
		ТрудоваяДеятельность.Организация = СтрокаОпытРаботы.Компания;
		ТрудоваяДеятельность.НомерПоПорядку = ОпытРаботы.Индекс(СтрокаОпытРаботы) + 1;
		ДанныеОТрудовойДеятельности.Добавить(ТрудоваяДеятельность);
	КонецЦикла;
		
	Возврат ДанныеОТрудовойДеятельности;
	
КонецФункции

// Параметры:
//  ЛичныеДанныеКандидата - СправочникСсылка.ЛичныеДанныеКандидатов
// 
// Возвращаемое значение:
//  Массив из Структура: см. РегистрыСведений.ЗнаниеЯзыковФизическихЛиц.НовоеЗнаниеЯзыка
Функция ДанныеОЗнанииЯзыковДляФизЛица(ЛичныеДанныеКандидата)
	
	ДанныеОЗнанииЯзыков = Новый Массив;
	
	ЗнаниеЯзыков = ПодборПерсонала.ЗнаниеЯзыковКандидатов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		ЛичныеДанныеКандидата));
		
	Для Каждого СтрокаЗнаниеЯзыков Из ЗнаниеЯзыков Цикл
		ЗнаниеЯзыка = РегистрыСведений.ЗнаниеЯзыковФизическихЛиц.НовоеЗнаниеЯзыка();
		ЗнаниеЯзыка.Язык = СтрокаЗнаниеЯзыков.Язык;
		ЗнаниеЯзыка.СтепеньЗнанияЯзыка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			СтрокаЗнаниеЯзыков.СтепеньЗнанияЯзыка, "СтепеньЗнанияЯзыка");
		ДанныеОЗнанииЯзыков.Добавить(ЗнаниеЯзыка);
	КонецЦикла;
		
	Возврат ДанныеОЗнанииЯзыков;
	
КонецФункции

// Параметры:
//  ЛичныеДанныеКандидата - СправочникСсылка.ЛичныеДанныеКандидатов
// 
// Возвращаемое значение:
//  Массив из Структура - см. РегистрыСведений.УченыеСтепениФизическихЛиц.НоваяУченаяСтепень
Функция ДанныеОбУченыхСтепеняхДляФизЛица(ЛичныеДанныеКандидата)
	
	ДанныеОбУченыхСтепенях = Новый Массив;
	
	УченыеСтепени = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЛичныеДанныеКандидата, "УченыеСтепени").Выгрузить();
	
	Для Каждого СтрокаУченаяСтепень Из УченыеСтепени Цикл
		УченаяСтепень = РегистрыСведений.УченыеСтепениФизическихЛиц.НоваяУченаяСтепень();
		ЗаполнитьЗначенияСвойств(УченаяСтепень, СтрокаУченаяСтепень);
		УченаяСтепень.НомерПоПорядку =  УченыеСтепени.Индекс(СтрокаУченаяСтепень) + 1;
		ДанныеОбУченыхСтепенях.Добавить(УченаяСтепень);
	КонецЦикла;
	
	Возврат ДанныеОбУченыхСтепенях;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
